# CTA Analysis - Visualizations
---
## Outline
This is part two of a two part analysis of the CTA Ridership data. In this section, I will focus on developing insights from the data.

In [1]:
import collections
import itertools
import sqlite3
import pandas as pd
import numpy as np

# import visualizations libraries
import folium
import matplotlib.pyplot as plt
import seaborn as sns
from folium import plugins

%matplotlib inline

In [2]:
# helper functions for sqlite3 
def connect(sqlite_file):
    """
    Make connection to an SQLite database file.
    """
    conn = sqlite3.connect(sqlite_file)
    c = conn.cursor()
    return conn, c

def close(conn):
    """ 
    Commit changes and close connection to the database.
    """
    conn.close()
    
def table_col_info(cursor, table_name, print_out=False):
    """
    Returns a list of tuples with column informations:
    (id, name, type, notnull, default_value, primary_key)
    """
    cursor.execute('PRAGMA TABLE_INFO({})'.format(table_name))
    info = cursor.fetchall()

    if print_out:
        print("\nColumn Info:\nID, Name, Type, NotNull, DefaultVal, PrimaryKey")
        for col in info:
            print(col)
    return info

In [3]:
# sql_db is my connection and sql_command is my cursor
sql_db, sql_command = connect('database/cta_bus_ridership.db')

In [36]:
stop_most_routes = """
                    SELECT br.stop_id,
                           bs.on_street,
                           bs.cross_street,
                           COUNT(*) AS num_routes 
                    FROM bus_stops as bs
                    JOIN bus_routes as br ON bs.stop_id = br.stop_id
                    GROUP BY br.stop_id 
                    ORDER BY num_routes DESC LIMIT 10;
                   """
test = pd.read_sql_query(num_routes, sql_db)
test

   stop_id on_street               cross_street  num_routes
0     1106  MICHIGAN                 WASHINGTON          14
1       73  MICHIGAN  betw. VAN BUREN & CONGRES          13
2     1103  MICHIGAN    HUBBARD (WRIGLEY BLDG.)          13
3     1120  MICHIGAN                SOUTH WATER          13
4     1122  MICHIGAN    HUBBARD (TRIBUNE BLDG.)          13
5     1100  MICHIGAN                       ERIE          12
6     1101  MICHIGAN                       OHIO          12
7     1102  MICHIGAN                   ILLINOIS          12
8     1105  MICHIGAN      betw. LAKE & RANDOLPH          12
9     1123  MICHIGAN                      GRAND          12

In [38]:
route_most_stops = """
                    SELECT br.route,
                           bs.on_street,
                           COUNT(*) AS num_stops
                    FROM bus_routes as br 
                    JOIN bus_stops as bs ON br.stop_id = bs.stop_id
                    GROUP BY br.route 
                    ORDER BY num_stops DESC LIMIT 10;
                   """
test = pd.read_sql_query(longest_route, sql_db)
test

  route       on_street  num_stops
0     9         ASHLAND        273
1    49         WESTERN        242
2   151           ADAMS        221
3     8         HALSTED        220
4     3        MICHIGAN        213
5    82           HOMAN        209
6    62           STATE        206
7    79     79TH STREET        206
8    N5  S. SHORE DRIVE        206
9     4   COTTAGE GROVE        202